# Taps
tap "daipeihust/tap"
tap "laishulu/homebrew"
tap "cargo-lambda/cargo-lambda"

# Shell & Terminal
brew "zsh-syntax-highlighting"
brew "peco"
brew "tmuxinator"
brew "screen"

# Editor
brew "neovim"
brew "lua-language-server"

# IME
brew "daipeihust/tap/im-select"
brew "laishulu/homebrew/macism"

# Languages & Runtimes
brew "node"
brew "deno"
brew "elixir"
brew "kotlin"
brew "python@3.9"

# Rust
brew "rust-analyzer"
brew "cargo-lambda/cargo-lambda/cargo-lambda"

# Search & File Utils
brew "ripgrep"
brew "fd"
brew "fzf"
brew "the_silver_searcher"
brew "bat"
brew "tree"

# Git & GitHub
brew "gh"

# Database
brew "postgresql@14"
brew "libpq"

# Build Tools
brew "gradle"
brew "protobuf"
brew "gnupg"

# Mobile Development
brew "fastlane"
brew "watchman"

# Misc Tools
brew "curl"
brew "ffmpeg"
brew "fswatch"
brew "libfido2"

# Casks
cask "chromium"
cask "font-jetbrains-mono-nerd-font"

