# ===================
# Taps
# ===================
tap "homebrew/core"
tap "k1low/tap"                      # git-wt
tap "daipeihust/tap"                 # im-select
tap "laishulu/homebrew"              # macism
tap "cargo-lambda/cargo-lambda"      # cargo-lambda (AWS Lambda向けRustビルド)

# ===================
# Libraries / Low-level
# ===================
brew "openssl@3"
brew "libssh2"
brew "xz"
brew "libyaml"
brew "unbound"                       # DNS resolver (gnutlsの依存)
brew "gnutls"
brew "libfido2"                      # FIDO2/WebAuthn

# ===================
# Shell & Terminal
# ===================
brew "zsh-syntax-highlighting"
brew "tmux"
brew "tmuxinator"                    # tmuxセッション管理
brew "screen"
brew "peco"                          # インタラクティブフィルタ

# ===================
# Editor
# ===================
brew "neovim"
brew "lua-language-server"

# ===================
# IME
# ===================
brew "daipeihust/tap/im-select"      # IME切替 (Neovim連携)
brew "laishulu/homebrew/macism"      # macOS IME制御

# ===================
# Languages & Runtimes
# ===================
brew "node"
brew "deno"
brew "erlang"
brew "elixir"
brew "kotlin"
brew "python@3.9"

# ===================
# Rust
# ===================
brew "rust-analyzer"
brew "cargo-lambda/cargo-lambda/cargo-lambda"

# ===================
# Search & File Utils
# ===================
brew "ripgrep"
brew "fd"
brew "fzf"
brew "the_silver_searcher"           # ag
brew "bat"                           # catの代替 (シンタックスハイライト付き)
brew "tree"

# ===================
# Git & GitHub
# ===================
brew "gh"
brew "k1low/tap/git-wt"             # git worktree管理

# ===================
# Database
# ===================
brew "postgresql@14"
brew "libpq"

# ===================
# Build Tools
# ===================
brew "gradle"
brew "protobuf"
brew "gnupg"

# ===================
# Mobile Development
# ===================
brew "fastlane"                      # iOS/Androidデプロイ自動化
brew "watchman"                      # ファイル変更監視 (React Native)

# ===================
# Misc Tools
# ===================
brew "curl"
brew "ffmpeg"
brew "fswatch"                       # ファイル変更監視

# ===================
# Casks
# ===================
cask "chromium"
cask "font-jetbrains-mono-nerd-font"

